//

export const strong2weak = {
  'η': ['α', 'ε', 'αι'],
  '': [''],
  '': [''],
  '': ['']
}

export const augments_ = {
  'α': ['η'],
  'αι': ['ῃ'],
  'ανα': ['ανε', 'ανη'],
  'αν': ['ανε'],
  'απα': ['απη'],
  // 'αστ': ['ανεστ'],

  'απαι': ['απῃ'],
  'απε': ['απει'],
  'απο': ['απε', 'απω'],
  'αφαι': ['αφῃ'],
  'αφο': ['αφω'],
  'αρα': ['ηρα'],
  'ε': ['η'],
  'δια': ['διε', 'διη'],
  'διε': ['διη'],
  'διαι': ['διῃ'],
  'εισε': ['ειση'],
  'εκ': ['εξε'],
  'εξα': ['εξη'],
  'εξε': ['εξη'],
  'εν': ['ενε'],
  'επεν': ['επενε'],
  'εμ': ['ενε'],

  'επα': ['επη'],
  'επαι': ['επῃ'],
  'επι': ['επε', 'επει'],
  'επε': ['επι', 'επη'],
  'επο': ['επω'],
  'ευα': ['ευη'],

  'η': ['ε'], // ηὗρον

  'κατα': ['κατε', 'κατη'],
  'κατοι': ['κατῳ'],
  'μετα': ['μετε'],
  'ο': ['ω'],
  'οι': ['ῳ'],
  'παρα': ['παρε'],
  'παρε': ['παρη'],
  'περι': ['περιε'],
  'περιε': ['περιη'],
  'προσ': ['προσε'],

  'προσα': ['προση'],
  'προσε': ['προση', 'προσ'],
  'προ': ['προε'],
  'ρ': ['ερρ'],
  'συνε': ['συνη', 'συνει', 'συμ'],
  'συλ': ['συνε'],
  'συμ': ['συνε'],
  'συσ': ['συνε'],
  'συγ': ['συνε'],
  'συνα': ['συνη'], // συνήγαγον - συναγόγον - to fake
  'υπα': ['υπη'],
  'υπο': ['υπε'],
  '': [''],
  '': [''],
  '': [''],
  '': [''],
  '': [''],
  '': [''],
  '': [''],
  '': [''],
  '': ['']
}
