// verbkeys

export const verbkeys = {}

verbkeys['έω-έομαι'] = {}
verbkeys['έω-έομαι'].vkeys = {
  pres: [ 'έω-έομαι', 'ῶ-οῦμαι' ],
  impf: [ 'εον-εόμην', 'ουν-ούμην' ],
  fut: [ 'ήσω-ήσομαι-ηθήσομαι' ],
  aor: [ 'ησα-ησάμην-ήθην' ] }
verbkeys['έω-έομαι'].pkeys = {
  pres: [ 'έων-έουσα-έον', 'ῶν-οῦσα-οῦν' ],
  impf: [],
  fut: [ 'ήσων-ήσουσα-ῆσον' ],
  aor: [ 'ήσας-ήσασα-ῆσαν' ]
}
verbkeys['έω-έομαι'].ikeys = {
  pres: [ 'έειν-έεσθαι', 'εῖν-εῖσθαι' ],
  impf: [],
  fut: [ 'ήσειν-ήσεσθαι-ηθήσεσθαι' ],
  aor: [ 'ῆσαι-ήσασθαι-ηθῆναι' ]
}

verbkeys['άω-άομαι'] = {}
verbkeys['άω-άομαι'].vkeys = {
  pres: [ 'άω-άομαι', 'ῶ-ῶμαι' ],
  impf: [ 'αον-αόμην', 'ων-ώμην' ],
  fut: [ 'ήσω-ήσομαι-ηθήσομαι' ],
  aor: [ 'ησα-ησάμην-ήθην' ],
  pf: [ 'ηκα' ],
  ppf: [ 'ήκειν' ]
}
verbkeys['άω-άομαι'].pkeys = {
  pres: [ 'άων-άουσα-άον', 'ῶν-ῶσα-ῶν' ],
  impf: [],
  fut: [ 'ήσων-ήσουσα-ῆσον' ],
  aor: [ 'ήσας-ήσασα-ῆσαν' ],
  pf: [ 'ηκώς-ηκυῖα-ηκός' ],
  ppf: []
}
verbkeys['άω-άομαι'].ikeys = {
  pres: [ 'άειν-άεσθαι', 'ᾶν-ᾶσθαι' ],
  impf: [],
  fut: [ 'ήσειν-ήσεσθαι-ηθήσεσθαι' ],
  aor: [ 'ῆσαι-ήσασθαι-ηθῆναι' ],
  pf: [ 'ηκέναι' ],
  ppf: []
}

verbkeys['όω-οῦμαι'] = {}
verbkeys['όω-οῦμαι'].vkeys = {
  pres: [ 'ῶ-οῦμαι' ],
  impf: [ 'ουν-ούμην' ],
  fut: [ 'ώσω-ώσομαι-ωθησήσομαι' ],
  aor: [ 'ωσα-ωσάμην-ώθην', 'ωσα-ωσάμην-ώθην' ],
  pf: [ 'ωκα-ωμαι' ],
  ppf: [ 'ώκειν-ώμην' ]
}
verbkeys['όω-οῦμαι'].pkeys = {
  pres: [ 'ῶν-οῦσα-οῦν' ],
  impf: [],
  fut: [ 'ώσων-ώσουσα-ῶσον' ],
  aor: [ 'ώσας-ώσασα-ῶσαν' ],
  pf: [ 'ωκώς-ωκυῖα-ωκός' ],
  ppf: []
}
verbkeys['όω-οῦμαι'].ikeys = {
  pres: [ 'οῦν-οῦσθαι' ],
  impf: [],
  fut: [ 'ώσειν-ώσεσθαι-ωθησήσεσθαι' ],
  aor: [ 'ῶσαι-ώσασθαι-ωθῆναι' ],
  pf: [ 'ωκέναι-ῶσθαι' ],
  ppf: []
}

verbkeys['ω-ομαι'] = {}
verbkeys['ω-ομαι'].vkeys = {
  pres: [ 'ω-ομαι' ],
  impf: [ 'ον-όμην' ],
  fut: [ 'σω-σομαι' ],
  aor: [ 'σα-σάμην-θην' ],
  pf: [ 'κα-μαι' ]
}
verbkeys['ω-ομαι'].pkeys = {
  pres: [ 'ων-ουσα-ον' ],
  impf: [],
  fut: [ 'σων-σουσα-σον' ],
  aor: [ 'σας-σασα-σαν' ],
  pf: [ 'κώς-κυῖα-κός' ]
}
verbkeys['ω-ομαι'].ikeys = {
  pres: [ 'ειν-εσθαι' ],
  impf: [],
  fut: [ 'σειν' ],
  aor: [ 'σαι-σασθαι-θῆναι' ],
  pf: [ 'κέναι-σθαι' ]
}

verbkeys['ημι-εμαι'] = {}
verbkeys['ημι-εμαι'].vkeys = {
  pres: [ 'ημι-εμαι',  'ημι-αμαι' ],
  impf: [ 'ην-έμην', 'ην-έμην',  'ην-άμην' ]
}
verbkeys['ημι-εμαι'].pkeys = {
  pres: [ 'είς-εῖσα-έν', 'άς-ᾶσα-άν'  ],
  impf: []
}
verbkeys['ημι-εμαι'].ikeys = {
  pres: [ 'έναι-εσθαι', 'άναι-ασθαι' ],
  impf: []
}
